[{"datetime":1698190203000,"headline":"#apple is reportedly planning to turn the TV app into the streaming hub it always wanted","source":"Byte Funding","url":"https://cloud.iexapis.com/v1/news/article/bHMvj15aLkciYG59tJMoBgKNXFAm0KEy3MDpQbZiEyN","summary":"The Apple TV app’s ambitions have always been huge. | Image: Apple Apple appears to be working on a revamp of its TV app that the company hopes will turn it into users’ go-to place for all their shows, movies, and more. A new Bloomberg report says Apple is planning to remove its apps for […] The post #apple is reportedly planning to turn the TV app into the streaming hub it always wanted appeared first on ByteFunding .","related":"AAPL,APC-GF,APC-GM,APC-GY,APC-GH,APC-GS,APC-GI,APC-GD,APC-GB,AAPL-MM,AAPL-QH","image":"https://cloud.iexapis.com/v1/news/image/bHMvj15aLkciYG59tJMoBgKNXFAm0KEy3MDpQbZiEyN","lang":"en","hasPaywall":false},{"datetime":1698188430000,"headline":"At a White House event, Apple says it supports nationwide right-to-repair regulation that would make iPhone parts and tools available to customers (Kif Leswing/CNBC)","source":"Techmeme","url":"https://cloud.iexapis.com/v1/news/article/3fHhsXbE6Cor0L9Z64UWFXN1uVxyAyvFF7QG1m4sM4Lu","summary":"Kif Leswing / CNBC : At a White House event, Apple says it supports nationwide right-to-repair regulation that would make iPhone parts and tools available to customers — - Apple supports nationwide right-to-repair regulation that would make iPhone parts and tools available to customers.","related":"AAPL,APC-GF,APC-GM,APC-GY,APC-GH,APC-GS,APC-GI,APC-GD,APC-GB,AAPL-MM,AAPL-QH","image":"https://cloud.iexapis.com/v1/news/image/3fHhsXbE6Cor0L9Z64UWFXN1uVxyAyvFF7QG1m4sM4Lu","lang":"en","hasPaywall":false},{"datetime":1698188093000,"headline":"Apple $1 Billion Annual Drive to Keep Pace with Generative AI: Insights","source":"EIN News Telecom Industry","url":"https://cloud.iexapis.com/v1/news/article/37ng4sJfrfXIt1A1PgtkQVzmrHHoPznp2qtfzWGHmpsT","summary":"Jawad Ali KhanLast Updated: Oct 24, 2023 In a recent report by Bloomberg, it was revealed that Apple is set to allocate a staggering $1 billion annually towards the development of its generative AI products. This substantial investment underscores the …","related":"AAPL,APC-GF,APC-GM,APC-GY,APC-GH,APC-GS,APC-GI,APC-GD,APC-GB,AAPL-MM,AAPL-QH","image":"https://cloud.iexapis.com/v1/news/image/37ng4sJfrfXIt1A1PgtkQVzmrHHoPznp2qtfzWGHmpsT","lang":"en","hasPaywall":false},{"datetime":1698187482000,"headline":"Apple is reportedly planning to turn the TV app into the streaming hub it always wanted","source":"The Verge","url":"https://cloud.iexapis.com/v1/news/article/49CILPoghYAE5sK1mb4axShVtDxDB6tidrPiGrfxEfi","summary":"The Apple TV app’s ambitions have always been huge. | Image: Apple Apple appears to be working on a revamp of its TV app that the company hopes will turn it into users’ go-to place for all their shows, movies, and more. A new Bloomberg report says Apple is planning to remove its apps for buying and renting content and bundle that with its streaming content, channel-subscription options, and more. The new app could launch as early as this December on the Apple TV box, across Apple’s other platforms, and on the other TV operating systems the Apple TV app is available on. (The fact that the Apple TV is distinct from the Apple TV app, which is not the same as Apple TV Plus, and that “Apple TV is available on Roku” is a technically true phrase never fails to blow my mind. These names! But I digress.) In a sense, there’s actually nothing new about this strategy. Apple has long wanted the TV app to be the place users went not just to find Apple’s own content but to find, subscribe to, and manage everything else.","related":"AAPL,APC-GF,APC-GM,APC-GY,APC-GH,APC-GS,APC-GI,APC-GD,APC-GB,AAPL-MM,AAPL-QH","image":"https://cloud.iexapis.com/v1/news/image/49CILPoghYAE5sK1mb4axShVtDxDB6tidrPiGrfxEfi","lang":"en","hasPaywall":false},{"datetime":1698186978000,"headline":"Stock Soars As AI Drives Record Revenue Again","source":"Bitcoin Ethereum News","url":"https://cloud.iexapis.com/v1/news/article/1foB7ihfnc3hDGthaZxntwNJ96E8VDuTuNnnItrmAnkq","summary":"The post Stock Soars As AI Drives Record Revenue Again appeared on BitcoinEthereumNews.com . Topline Microsoft smashed expectations in its earnings report released Tuesday afternoon, as the Redmond, Washington-based technology behemoth continues to cash in on the artificial intelligence craze. Microsoft CEO Satya Nadella has looked externally for growth, overseeing a reported $10 billion … [+] investment in OpenAI and acquiring Activision Blizzard for $69 billion. Getty Images Key Facts Microsoft brought in $56.5 billion of total sales during the three-month period ending September 30, well above consensus analyst estimates of $54.5 billion, according to FactSet. This was 13% higher than the same period last year and broke last quarter’s record $56.2 billion in revenue. Top line growth also came in hotter than expected: Microsoft’s $2.99 earnings per share smashed estimates of $2.65 and topped last quarter’s $2.69. The robust earnings came as expansion in its heavily AI-exposed intelligent cloud unit swelled to $24.3 billion, marking about 20% annual growth.","related":"AAPL,APC-GF,APC-GM,APC-GY,APC-GH,APC-GS,APC-GI,APC-GD,APC-GB,AAPL-MM,AAPL-QH,MSFT,MSF-GF,MSF-GM,MSF-GY,MSF-GH,MSF-GS,MSF-GI,MSF-GD,MSF-GB,MSFT-QH","image":"https://cloud.iexapis.com/v1/news/image/1foB7ihfnc3hDGthaZxntwNJ96E8VDuTuNnnItrmAnkq","lang":"en","hasPaywall":false}]